brew "atuin"
brew "bash"
brew "bat"
brew "btop"
brew "coreutils"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "ghq"
brew "git"
brew "git-delta"
brew "gnu-sed"
brew "helm-ls"
brew "kubectx"
brew "lua-language-server"
brew "mise"
brew "prettier"
brew "ripgrep"
brew "shfmt"
brew "sniffnet"
brew "starship"
brew "stylua"
brew "taplo"
brew "terraform-ls"
brew "tlrc"
brew "tmux"
brew "tombi"
brew "tree"
brew "tree-sitter"
brew "tree-sitter-cli"
brew "yq"
brew "zip"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
cask "1password"
cask "1password-cli"
cask "chatgpt"
cask "claude"
cask "cloudflare-warp"
cask "codex"
cask "codex-app"
cask "docker-desktop"
cask "drawio"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "google-drive"
cask "google-japanese-ime"
cask "microsoft-edge"
cask "obsidian"
cask "raycast"
cask "rectangle"
cask "slack"
cask "visual-studio-code"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "charliermarsh.ruff"
vscode "esbenp.prettier-vscode"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "ms-azuretools.vscode-containers"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.python"
vscode "ms-vscode-remote.remote-containers"
vscode "redhat.vscode-yaml"
vscode "tombi-toml.tombi"
go "cmd/go"
go "cmd/gofmt"
go "golang.org/x/tools/gopls"
